In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math

In [2]:
salary = pd.read_csv('StackOverflowDeveloperSurvey2018.csv', usecols=['Salary']).squeeze().dropna()
salary.head()

<ipython-input-2-6539a3b97ba4>:1: DtypeWarning: Columns (52) have mixed types. Specify dtype option on import or set low_memory=False.
  salary = pd.read_csv('StackOverflowDeveloperSurvey2018.csv', usecols=['Salary']).squeeze().dropna()

1     51000
4    260000
5     30000
6    120000
8    250000
Name: Salary, dtype: object

In [3]:
len(salary)

50578

In [4]:
min(salary)

'.0'

In [5]:
max(salary)

'999999999999999999999999999999'

In [6]:
list(salary.head())

['51000', '260000', '30000', '120000', '250000']

In [7]:
listSalarySorted = sorted(salary, reverse=True)
listSalarySorted[:5]

['999999999999999999999999999999',
 '99999999999999999',
 '99999999',
 '99999',
 '99999']

In [8]:
salary = salary.rename('Salary of a person')
salary.head()

1     51000
4    260000
5     30000
6    120000
8    250000
Name: Salary of a person, dtype: object